modules/gateway/server/src/test/resources/com/l7tech/server/policy/resources/REQUEST_httpwssheaderpromote_success.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
          <wsse:Security actor="asdf" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
                <wsse:Username>user</wsse:Username>
                <wsse:Password>pass</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <tns:listProducts xmlns:tns="http://warehouse.acme.com/ws">
            <tns:delay>0</tns:delay>
        </tns:listProducts>
    </soapenv:Body>
</soapenv:Envelope>
